Autodesk.Revit.DB.ViewPlan.SetUnderlayOrientation(Autodesk.Revit.DB.UnderlayOrientation)
Sets the underlay orientatio for this view.
uo:
The underlay orientation for this view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ViewPlan.GetUnderlayOrientation
Returns the underlay orientation for this view.

Autodesk.Revit.DB.ViewPlan.SetUnderlayBaseLevel(Autodesk.Revit.DB.ElementId)
Sets the level whose elevation will determine the bottom of the underlay range.
The elevation of the next highest level will be used to determine the top of the underlay range.
Remarks:
If the level specified is the highest level, the underlay range will be unbounded and
the underlay range will consist of everything above the specified level.
levelId:
The id of a level in the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId does not correspond to a Level in the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ViewPlan.GetUnderlayTopLevel
Returns the element id of the level that defines the bottom of the underlay range.

Autodesk.Revit.DB.ViewPlan.GetUnderlayBaseLevel
Returns the element id of the level that defines the bottom of the underlay range.